Table: Products

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| product_id  | int     |
| store1      | int     |
| store2      | int     |
| store3      | int     |
+-------------+---------+
product_id is the primary key (column with unique values) for this table.
Each row in this table indicates the product's price in 3 different stores: store1, store2, and store3.
If the product is not available in a store, the price will be null in that store's column.
 

Write a solution to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Products table:
+------------+--------+--------+--------+
| product_id | store1 | store2 | store3 |
+------------+--------+--------+--------+
| 0          | 95     | 100    | 105    |
| 1          | 70     | null   | 80     |
+------------+--------+--------+--------+
Output: 
+------------+--------+-------+
| product_id | store  | price |
+------------+--------+-------+
| 0          | store1 | 95    |
| 0          | store2 | 100   |
| 0          | store3 | 105   |
| 1          | store1 | 70    |
| 1          | store3 | 80    |
+------------+--------+-------+
Explanation: 
Product 0 is available in all three stores with prices 95, 100, and 105 respectively.
Product 1 is available in store1 with price 70 and store3 with price 80. The product is not available in store2.

In [1]:
import pandas as pd

def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    stores = list(products.columns[1:])
    ids = list(products.product_id)
    res = pd.DataFrame(pd.concat([pd.DataFrame([[i,j] for i in ids for j in stores], columns = ['product_id','store']), 
                              pd.DataFrame(data = [[pd.NA] for _ in range(len(stores)*len(ids))], columns = ['price'])], axis = 1))
    for i in ids:
        for j in stores:
            try:
                res.loc[(res.product_id == i) & (res.store == j), ['price']] = int(products.loc[products.product_id == i, list(products.columns)[list(products.columns).index(j)]])
            except:
                res.loc[(res.product_id == i) & (res.store == j), ['price']] = pd.NA
    return res.dropna()

In [2]:
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

In [3]:
products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70    <NA>      80

In [4]:
stores = list(products.columns[1:])
stores

['store1', 'store2', 'store3']

In [5]:
ids = list(products['product_id'])
ids

[0, 1]

In [6]:
res = pd.DataFrame(pd.concat([pd.DataFrame([[i,j] for i in ids for j in stores], columns = ['product_id','store']), 
                              pd.DataFrame(data = [[pd.NA] for _ in range(len(stores)*len(ids))], columns = ['price'])], axis = 1))

res

   product_id   store price
0           0  store1  <NA>
1           0  store2  <NA>
2           0  store3  <NA>
3           1  store1  <NA>
4           1  store2  <NA>
5           1  store3  <NA>

In [7]:
i = 0
j = 'store1'


res.loc[(res.product_id == i) & (res.store == j), ['price']] = int(products.loc[products.product_id == i, list(products.columns)[list(products.columns).index(j)]])
res

   product_id   store price
0           0  store1    95
1           0  store2  <NA>
2           0  store3  <NA>
3           1  store1  <NA>
4           1  store2  <NA>
5           1  store3  <NA>

In [8]:
list(products.columns)[list(products.columns).index(j)]

'store1'

In [9]:
for i in ids:
    for j in stores:
        try:
            res.loc[(res.product_id == i) & (res.store == j), ['price']] = int(products.loc[products.product_id == i, list(products.columns)[list(products.columns).index(j)]])
        except:
            res.loc[(res.product_id == i) & (res.store == j), ['price']] = pd.NA
            
res

   product_id   store price
0           0  store1    95
1           0  store2   100
2           0  store3   105
3           1  store1    70
4           1  store2  <NA>
5           1  store3    80

In [10]:
rearrange_products_table(products)

   product_id   store price
0           0  store1    95
1           0  store2   100
2           0  store3   105
3           1  store1    70
5           1  store3    80

In [11]:
import pandas as pd

def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    return products.melt(id_vars = 'product_id', value_vars = ['store1','store2','store3'], var_name = 'store').dropna().rename(columns = {'value':'price'})

In [12]:
rearrange_products_table(products)

   product_id   store price
0           0  store1    95
1           1  store1    70
2           0  store2   100
4           0  store3   105
5           1  store3    80

In [13]:
products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70    <NA>      80

In [14]:
products.melt(id_vars = 'product_id', value_vars = ['store1','store2','store3'], var_name = 'store').dropna()

   product_id   store value
0           0  store1    95
1           1  store1    70
2           0  store2   100
4           0  store3   105
5           1  store3    80